In [1]:
# NIM/Nama  : 19622078/Raden Francisco Trianto Bratadingrat
# Tanggal   : 15 November 2022
# Deskripsi : Problem 2 

import pandas as pd
import matplotlib.pyplot as plt
df = pd.read_csv("H05.csv")

In [2]:
df.loc[df["nama"] == "Tuan Leo"]

          nama fakultas  nilai_mat  nilai_kim  nilai_fis
3513  Tuan Leo     STEI      96.78      62.23      30.53

In [3]:
df.loc[df["nilai_fis"] == df["nilai_fis"].max()]

                         nama fakultas  nilai_mat  nilai_kim  nilai_fis
1936  Yuniar Fazriani Rusmana     FITB      53.61      67.19      92.57

In [4]:
df.sort_values(by="nilai_kim", ascending=False).head(10).reset_index(drop=True)

                       nama fakultas  nilai_mat  nilai_kim  nilai_fis
0      Faathir Reza Avicena     FTSL      57.12      81.50      78.68
1      Dinda A A Z Mundakir     STEI      41.18      81.34      82.60
2        Tammya Ayu Purnomo    SITHS      74.49      81.20      78.58
3    Alyssa Nadhira Windari     FTMD      78.38      78.83      78.68
4          Izni Nur Ibrahim     STEI      56.70      78.46      84.34
5      Rinaldi Oky Setiawan     STEI      71.22      77.44      83.66
6      Ias Azhari Rezkyarno    FMIPA      62.85      76.90      81.52
7           Klara Petra T T     FTSL      73.39      76.61      78.12
8  Naudy Germanimo Laksmana     FTMD      62.29      76.38      76.15
9       Mardliyahtur Rohmah     STEI      63.15      76.36      74.06

In [5]:
print("Banyak nilai mat dibawah 50:", len(df.loc[df["nilai_mat"] < 50]))

Banyak nilai mat dibawah 50: 329

In [6]:
print("Banyak mahasiswa FMIPA:", len(df.loc[df["fakultas"] == "FMIPA"]))

Banyak mahasiswa FMIPA: 627